Revit 2026 API

# RebarReinforcementData Methods

---

The RebarReinforcementData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarReinforcementData, or  if the operation fails. |
|  | Dispose | (Inherited from ReinforcementData) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RebarReinforcementData Class

Autodesk.Revit.DB.Structure Namespace